Chapter 1 - How a Data Scientist Beat the Odds
Chapter 2 - A Data Science Framework
Chapter 3 - Step 1: Define the Problem and Step 2: Gather the Data
Chapter 4 - Step 3: Prepare Data for Consumption
Chapter 5 - The 4 C's of Data Cleaning: Correcting, Completing, Creating, and Converting
Chapter 6 - Step 4: Perform Exploratory Analysis with Statistics
Chapter 7 - Step 5: Model Data
Chapter 8 - Evaluate Model Performance
Chapter 9 - Tune Model with Hyper-Parameters
Chapter 10 - Tune Model with Feature Selection
Chapter 11 - Step 6: Validate and Implement
Chapter 12 - Conclusion and Step 7: Optimize and Strategize
Change Log
Credits

In [157]:
import pandas as pd
import numpy as np

In [158]:
train=pd.read_csv('data/train.csv')

In [159]:
test=pd.read_csv('data/test.csv')

In [160]:
data_cleaner=[train,test]

In [161]:
print(train.info())
train.sample(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
419,420,0,3,"Van Impe, Miss. Catharina",female,10.0,0,2,345773,24.1500,NaN,S
278,279,0,3,"Rice, Master. Eric",male,7.0,4,1,382652,29.1250,NaN,Q
538,539,0,3,"Risien, Mr. Samuel Beard",male,NaN,0,0,364498,14.5000,NaN,S
499,500,0,3,"Svensson, Mr. Olof",male,24.0,0,0,350035,7.7958,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
702,703,0,3,"Barbara, Miss. Saiide",female,18.0,0,1,2691,14.4542,NaN,C
559,560,1,3,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",female,36.0,1,0,345572,17.4000,NaN,S
584,585,0,3,"Paulner, Mr. Uscher",male,NaN,0,0,3411,8.7125,NaN,C
452,453,0,1,"Foreman, Mr. Benjamin Laventall",male,30.0,0,0,113051,27.7500,C111,C

In [162]:
train.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Endres, Miss. Caroline Louise",male,NaN,NaN,NaN,CA. 2343,NaN,C23 C25 C27,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [163]:
train_null=train.isnull().sum()
train_null[train_null>0].sort_values(ascending=False)

Cabin       687
Age         177
Embarked      2
dtype: int64

In [164]:
#Clean data

In [165]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [166]:
train=train.drop(['PassengerId'],axis=1)

In [167]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [168]:
train=train.drop(['Ticket','Cabin'],axis=1)

In [169]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [170]:
train=train.drop(['Name'],axis=1)

In [171]:
train['Embarked']=train.Embarked.fillna('S')

In [240]:
train.isnull().sum()

Survived    0
Pclass      0
Age         0
Fare        0
Embarked    0
Family      0
person      0
dtype: int64

In [172]:
train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [173]:
train.Embarked.value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [174]:
train.Embarked[train['Embarked']=='S']=0
train.Embarked[train['Embarked']=='C']=1
train.Embarked[train['Embarked']=='Q']=2

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [175]:
train.Embarked.value_counts()

0    646
1    168
2     77
Name: Embarked, dtype: int64

In [176]:
train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        0
1         1       1  female  38.0      1      0  71.2833        1
2         1       3  female  26.0      0      0   7.9250        0
3         1       1  female  35.0      1      0  53.1000        0
4         0       3    male  35.0      0      0   8.0500        0

In [177]:
train['Family']=train['SibSp']+train['Parch']

In [178]:
train.sample(30)

     Survived  Pclass     Sex   Age  SibSp  Parch      Fare Embarked  Family
425         0       3    male   NaN      0      0    7.2500        0       0
197         0       3    male  42.0      0      1    8.4042        0       1
352         0       3    male  15.0      1      1    7.2292        1       2
463         0       2    male  48.0      0      0   13.0000        0       0
273         0       1    male  37.0      0      1   29.7000        1       1
95          0       3    male   NaN      0      0    8.0500        0       0
274         1       3  female   NaN      0      0    7.7500        2       0
9           1       2  female  14.0      1      0   30.0708        1       1
88          1       1  female  23.0      3      2  263.0000        0       5
493         0       1    male  71.0      0      0   49.5042        1       0
36          1       3    male   NaN      0      0    7.2292        1       0
329         1       1  female  16.0      0      1   57.9792        1       1
461         0       3    male  34.0      0      0    8.0500        0       0
646         0       3    male  19.0      0      0    7.8958        0       0
530         1       2  female   2.0      1      1   26.0000        0       2
597         0       3    male  49.0      0      0    0.0000        0       0
224         1       1    male  38.0      1      0   90.0000        0       1
820         1       1  female  52.0      1      1   93.5000        0       2
424         0       3    male  18.0      1      1   20.2125        0       2
396         0       3  female  31.0      0      0    7.8542        0       0
500         0       3    male  17.0      0      0    8.6625        0       0
805         0       3    male  31.0      0      0    7.7750        0       0
134         0       2    male  25.0      0      0   13.0000        0       0
307         1       1  female  17.0      1      0  108.9000        1       1
264         0       3  female   NaN      0      0    7.7500        2       0
604         1       1    male  35.0      0      0   26.5500        1       0
240         0       3  female   NaN      1      0   14.4542        1       1
488         0       3    male  30.0      0      0    8.0500        0       0
185         0       1    male   NaN      0      0   50.0000        0       0
768         0       3    male   NaN      1      0   24.1500        2       1

In [179]:
train.Family[train['Family']>=1]=1

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [180]:
train.sample(20)

     Survived  Pclass     Sex   Age  SibSp  Parch      Fare Embarked  Family
557         0       1    male   NaN      0      0  227.5250        1       0
56          1       2  female  21.0      0      0   10.5000        0       0
163         0       3    male  17.0      0      0    8.6625        0       0
282         0       3    male  16.0      0      0    9.5000        0       0
204         1       3    male  18.0      0      0    8.0500        0       0
360         0       3    male  40.0      1      4   27.9000        0       1
234         0       2    male  24.0      0      0   10.5000        0       0
577         1       1  female  39.0      1      0   55.9000        0       1
479         1       3  female   2.0      0      1   12.2875        0       1
369         1       1  female  24.0      0      0   69.3000        1       0
531         0       3    male   NaN      0      0    7.2292        1       0
715         0       3    male  19.0      0      0    7.6500        0       0
520         1       1  female  30.0      0      0   93.5000        0       0
138         0       3    male  16.0      0      0    9.2167        0       0
736         0       3  female  48.0      1      3   34.3750        0       1
203         0       3    male  45.5      0      0    7.2250        1       0
512         1       1    male  36.0      0      0   26.2875        0       0
284         0       1    male   NaN      0      0   26.0000        0       0
828         1       3    male   NaN      0      0    7.7500        2       0
533         1       3  female   NaN      0      2   22.3583        1       1

In [181]:
train=train.drop(['SibSp','Parch'],axis=1)

In [182]:
train.head()

   Survived  Pclass     Sex   Age     Fare Embarked  Family
0         0       3    male  22.0   7.2500        0       1
1         1       1  female  38.0  71.2833        1       1
2         1       3  female  26.0   7.9250        0       0
3         1       1  female  35.0  53.1000        0       1
4         0       3    male  35.0   8.0500        0       0

In [183]:
def get_person(passenger):
    age,sex=passenger
    return 'child' if age<16 else sex

In [184]:
train['person']=train[['Age','Sex']].apply(get_person,axis=1)

In [185]:
train.drop(['Sex'],axis=1,inplace=True)

In [186]:
train.head()

   Survived  Pclass   Age     Fare Embarked  Family  person
0         0       3  22.0   7.2500        0       1    male
1         1       1  38.0  71.2833        1       1  female
2         1       3  26.0   7.9250        0       0  female
3         1       1  35.0  53.1000        0       1  female
4         0       3  35.0   8.0500        0       0    male

In [187]:
train.person[train['person']=='male']=0
train.person[train['person']=='female']=1
train.person[train['person']=='child']=2

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [188]:
train.head()

   Survived  Pclass   Age     Fare Embarked  Family person
0         0       3  22.0   7.2500        0       1      0
1         1       1  38.0  71.2833        1       1      1
2         1       3  26.0   7.9250        0       0      1
3         1       1  35.0  53.1000        0       1      1
4         0       3  35.0   8.0500        0       0      0

In [189]:
train.isnull().sum()

Survived      0
Pclass        0
Age         177
Fare          0
Embarked      0
Family        0
person        0
dtype: int64

In [190]:
average_age=train.Age.mean()
std_age=train.Age.std()
count_nan=train.Age.isnull().sum()

In [191]:
average_age

29.69911764705882

In [192]:
std_age

14.526497332334044

In [193]:
count_nan

177

In [194]:
rand_train=np.random.randint(average_age-std_age,average_age+std_age,size=count_nan)

In [195]:
train['Age'][np.isnan(train['Age'])]=rand_train

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [196]:
train.isnull().sum()

Survived    0
Pclass      0
Age         0
Fare        0
Embarked    0
Family      0
person      0
dtype: int64

In [197]:
train.head()

   Survived  Pclass   Age     Fare Embarked  Family person
0         0       3  22.0   7.2500        0       1      0
1         1       1  38.0  71.2833        1       1      1
2         1       3  26.0   7.9250        0       0      1
3         1       1  35.0  53.1000        0       1      1
4         0       3  35.0   8.0500        0       0      0

In [198]:
train['Age']=train.Age.astype(int)

In [199]:
train['Embarked']=train.Embarked.astype(int)

In [200]:
train['person']=train.person.astype(int)

In [201]:
train.info()
train.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Age         891 non-null int32
Fare        891 non-null float64
Embarked    891 non-null int32
Family      891 non-null int64
person      891 non-null int32
dtypes: float64(1), int32(3), int64(3)
memory usage: 38.4 KB

   Survived  Pclass  Age     Fare  Embarked  Family  person
0         0       3   22   7.2500         0       1       0
1         1       1   38  71.2833         1       1       1
2         1       3   26   7.9250         0       0       1
3         1       1   35  53.1000         0       1       1
4         0       3   35   8.0500         0       0       0

In [202]:
test.info()
test.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [203]:
test.drop(['PassengerId'],axis=1,inplace=True)

In [204]:
test.drop(['Name','Ticket','Cabin'],axis=1,inplace=True)

In [205]:
test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [206]:
test.isnull().sum()

Pclass       0
Sex          0
Age         86
SibSp        0
Parch        0
Fare         1
Embarked     0
dtype: int64

In [207]:
average_test_age=test.Age.mean()
std_test_age=test.Age.std()
count_test=test.Age.isnull().sum()

In [208]:
rand_test=np.random.randint(average_test_age-std_test_age,average_test_age+std_test_age,size=count_test)

In [209]:
test['Age'][np.isnan(test['Age'])]=rand_test

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [210]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
Pclass      418 non-null int64
Sex         418 non-null object
Age         418 non-null float64
SibSp       418 non-null int64
Parch       418 non-null int64
Fare        417 non-null float64
Embarked    418 non-null object
dtypes: float64(2), int64(3), object(2)
memory usage: 22.9+ KB

In [211]:
test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [212]:
test['Family']=test['SibSp']+test['Parch']

In [213]:
test.Family[test.Family>=1]=1

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [214]:
test.Embarked.value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [215]:
test.Embarked[test.Embarked=='S']=0
test.Embarked[test.Embarked=='C']=1
test.Embarked[test.Embarked=='Q']=2

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [216]:
test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Family
0       3    male  34.5      0      0   7.8292        2       0
1       3  female  47.0      1      0   7.0000        0       1
2       2    male  62.0      0      0   9.6875        2       0
3       3    male  27.0      0      0   8.6625        0       0
4       3  female  22.0      1      1  12.2875        0       1

In [217]:
test['person']=test[['Age','Sex']].apply(get_person,axis=1)

In [218]:
test.drop(['Sex'],axis=1,inplace=True)

In [219]:
test.info()
test.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
Pclass      418 non-null int64
Age         418 non-null float64
SibSp       418 non-null int64
Parch       418 non-null int64
Fare        417 non-null float64
Embarked    418 non-null object
Family      418 non-null int64
person      418 non-null object
dtypes: float64(2), int64(4), object(2)
memory usage: 26.2+ KB

   Pclass   Age  SibSp  Parch     Fare Embarked  Family  person
0       3  34.5      0      0   7.8292        2       0    male
1       3  47.0      1      0   7.0000        0       1  female
2       2  62.0      0      0   9.6875        2       0    male
3       3  27.0      0      0   8.6625        0       0    male
4       3  22.0      1      1  12.2875        0       1  female

In [220]:
test.person[test.person=='male']=0
test.person[test.person=='female']=1
test.person[test.person=='child']=2

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [221]:
test['person']=test.person.astype(int)

In [222]:
test.Embarked=test.Embarked.astype(int)

In [223]:
test['Age']=test.Age.astype(int)

In [224]:
test.info()
test.head()
test.drop(['SibSp','Parch'],axis=1,inplace=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
Pclass      418 non-null int64
Age         418 non-null int32
SibSp       418 non-null int64
Parch       418 non-null int64
Fare        417 non-null float64
Embarked    418 non-null int32
Family      418 non-null int64
person      418 non-null int32
dtypes: float64(1), int32(3), int64(4)
memory usage: 21.3 KB

In [225]:
test.head()

   Pclass  Age     Fare  Embarked  Family  person
0       3   34   7.8292         2       0       0
1       3   47   7.0000         0       1       1
2       2   62   9.6875         2       0       0
3       3   27   8.6625         0       0       0
4       3   22  12.2875         0       1       1

In [243]:
test.dropna(subset=['Fare'], inplace=True)

#train['Embarked']=train.Embarked.fillna('S')

In [246]:
train['Fare']=train['Fare'].astype(int)
test['Fare']=test['Fare'].astype(int)
test['Family']=test['Family'].astype(int)
train.info()
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Age         891 non-null int32
Fare        891 non-null int32
Embarked    891 non-null int32
Family      891 non-null int64
person      891 non-null int32
dtypes: int32(4), int64(3)
memory usage: 34.9 KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 417 entries, 0 to 417
Data columns (total 6 columns):
Pclass      417 non-null int64
Age         417 non-null int32
Fare        417 non-null int32
Embarked    417 non-null int32
Family      417 non-null int32
person      417 non-null int32
dtypes: int32(5), int64(1)
memory usage: 14.7 KB

In [247]:
X_train=train.drop("Survived",axis=1)
Y_train=train['Survived']

In [248]:
X_test=test.copy()

In [249]:
from sklearn.ensemble import RandomForestClassifier
random_forest=RandomForestClassifier(n_estimators=100)
random_forest.fit(X_train,Y_train)

Y_pred=random_forest.predict(X_test)

random_forest.score(X_train,Y_train)

0.9652076318742986